src/cf/Catalogs/инт_Подписчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>инт_Подписчики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособПередачиИдентификатораСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СпособыПередачиПараметровПоHTTP</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачиИдентификатораПотока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СпособыПередачиПараметровПоHTTP</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодписчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_ТипыПодписчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаСервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Эндпоинты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПопыткамиОбработки</Name>
					<Comment>Пауза между попытками обработки в секундах.(0 - сообщение будет обработано повторно как можно быстрее)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТопика</Name>
					<Comment>Имя топика kafka</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетнаяОбработка</Name>
					<Comment>Сообщения будут отправлены не сразу, а перед завершением обработки потока одним пакетом</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПостПроцессинг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСостояния</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/инт_ТипыПодписчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>инт_ТипыПодписчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>RabbitMQ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодсистемаИнтеграции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйHTTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JRPC2</Name>
					<Comment>Тип подписчика JSON-RPC 2.0</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Kafka</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/инт_Подписчики/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

    Если ТипПодписчика = Перечисления.инт_ТипыПодписчиков.ПроизвольныйHTTP Тогда
    	ПроверяемыеРеквизиты.Добавить("СпособПередачиИдентификатораСообщения");
        ПроверяемыеРеквизиты.Добавить("СпособПередачиИдентификатораПотока");
	ИначеЕсли ТипПодписчика = Перечисления.инт_ТипыПодписчиков.Kafka Тогда
		ПроверяемыеРеквизиты.Добавить("ИмяТопика");
    КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
